# 1, 2, 3 더하기 5
# d[n][0] = d[n-1][1] + d[n-1][2]
# d[n][1] = d[n-2][0] + d[n-2][2]
# d[n][2] = d[n-3][0] + d[n-3][1]
# sum(d[n]) n >= 4
n_li = []
for _ in range(int(input())):
    n_li.append(int(input()))

d = [[0 for _ in range(3)] for _ in range(100001)]

d[1] = [1, 0, 0]
d[2] = [0, 1, 0]
d[3] = [1, 1, 1]
for i in range(4, 100001):
    d[i][0] = d[i - 1][1] % 1000000009 + d[i - 1][2] % 1000000009
    d[i][1] = d[i - 2][0] % 1000000009 + d[i - 2][2] % 1000000009
    d[i][2] = d[i - 3][0] % 1000000009 + d[i - 3][1] % 1000000009

for n in n_li:
    print(sum(d[n]) % 1000000009)